cf_billing/DataProcessors/энргКлючиПомещенийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргКлючиПомещенийМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПроживающих</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПрописанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПрописанных</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоСобственников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоСобственников</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПомещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПомещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКатегорииПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фиктивное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргКлючиПомещенийМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПолучениеДанных

Функция РезультатДанныеПомещенияПоКлючу(КлючПомещения) Экспорт
		
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКлючиПомещенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКлючиПомещенийМенеджер"].РезультатДанныеПомещенияПоКлючу(КлючПомещения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргКлючиПомещений.РезультатДанныеПомещенияПоКлючу(КлючПомещения);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ПараметрыМетода 				= Новый Структура("КлючПомещения",КлючПомещения);
		ИмяМетода 						= "энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу";
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Функция КлючПомещенияПоСтроениюИПомещению(Строение, Помещение) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжКлючиПомещенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжКлючиПомещенийМенеджер"].КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргКлючиПомещений.КлючПомещенияПоСтроениюИПомещению(Строение, Помещение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению";
		ПараметрыМетода 			= Новый Структура("Строение, Помещение",Строение, Помещение); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КлючиПомещенийПоРодителюПомещения(Организация, Родитель) Экспорт
	Схема 				= Неопределено;
	ТаблицаИерархии 	= "ИерархияРодителяПомещения";
	ТаблицаКлючей 		= "ДанныеПомещения";	 	
	
	Справочники.энргПомещения.ПомещенияПоРодителю(Схема, ТаблицаИерархии);
	
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица(ТаблицаИерархии, Новый Структура("Строение, Помещение", "Строение", "Помещение")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема, ПараметрыСхемы, ТаблицаКлючей);
	Пакет 									= Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество()-1];
	Оператор 								= Пакет.Операторы[0];
	Оператор.ВыбираемыеПоля.Добавить("&Организация");
	КолонкаЗапроса  						= Пакет.Колонки[Пакет.Колонки.Количество()-1];
	КолонкаЗапроса.Псевдоним 				= "Организация"; 	
	
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВременнаяТаблица(ТаблицаКлючей, Новый Структура("Организация, Район, КлючПомещения", "Организация", "Район", "КлючПомещения")));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	РегистрыСведений.энргАбонентыПомещений.ТекущийАбонентВПомещении(Схема, ПараметрыСхемы); 	
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация"	, Организация);
	ПараметрыЗапроса.Вставить("Родитель"	, Родитель);
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса); 
	
	Возврат РезультатЗапроса;	
КонецФункции

#Область ДанныеОКоличествеЧеловек

Функция КоличествоПроживающихПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));//Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоПроживающих.КоличествоПроживающихПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
КонецФункции

Функция КоличествоПрописанныхПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));//Новый Структура("ИмяПараметра, ТипПараметра", "Период" ,"Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоПрописанных.КоличествоПрописанныхПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
КонецФункции

Функция КоличествоСобственниковПомещения(Период, Организация, Район, КлючПомещения) Экспорт
	Схема 				= Новый СхемаЗапроса;
	ПараметрыОтбора 	= Новый Структура;
	ПараметрыЗапроса 	= Новый Структура;
	
	ПараметрыВТ 		= Новый Массив;	
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Организация"		, "Организация")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Район"			, "Район")));
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения"	, "КлючПомещения")));
	
	ПараметрыОтбора.Вставить("Период"		, энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	ПараметрыОтбора.Вставить("ПараметрыВТ"	, ПараметрыВТ);
	
	РегистрыСведений.энргКоличествоСобственников.КоличествоСобственниковПомещения(Схема, ПараметрыОтбора);
	
	ПараметрыЗапроса.Вставить("Период"			, Новый Граница(Период, ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Организация"		, Организация);
	ПараметрыЗапроса.Вставить("Район"			, Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения"	, КлючПомещения);	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);	
КонецФункции
	
#КонецОбласти

#КонецОбласти

Процедура ЗаполнитьДанныеКлючаПомещения(Форма, Знач ДанныеПомещенияРезультат) Экспорт
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(Форма, ДанныеПомещенияВыборка, "Строение, Помещение, ЧастныйСектор");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Дополнить схему запроса актуальными адресами ключа помещений
//
// Параметры:
//  Схема						 - СхемаЗапроса - Схема запроса
//  ИмяВременнойТаблицыИсточника - Строка - Имя временной таблицы источника запроса с обязательными полями:
//      * КлючПомещения - Справочник.энргКлючиПомещения  - ссылка на объект,
//      * Строение - Справочник.энргСтроения  - ссылка на объект,
//      * Помещение - Справочник.энргПомещения  - ссылка на объект,
//      * ЧастныйСектор - Булево - признак частного сектора.
//
Процедура ДополнитьСхемуЗапросаАктуальнымиАдресамиКлючаПомещений(Схема, ИмяВременнойТаблицыИсточника) Экспорт	
	Пакет 		= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаКонтактнаяИнформацияКлючаПомещения(ИмяВременнойТаблицыИсточника));	
	
	Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияКлючаПомещения.КлючПомещения КАК КлючПомещения,
	|	КонтактнаяИнформацияКлючаПомещения.АдресОбъектаЛС КАК АдресОбъектаЛС,
	|	КонтактнаяИнформацияКлючаПомещения.ЗначениеПолейКИ КАК ЗначениеПолейКИ
	|ПОМЕСТИТЬ АктуальнаяКонтактнаяИнформацияКлючаПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформацияКлючаПомещения.КлючПомещения КАК КлючПомещения,
	|		МАКСИМУМ(КонтактнаяИнформацияКлючаПомещения.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		КонтактнаяИнформацияКлючаПомещения КАК КонтактнаяИнформацияКлючаПомещения
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КонтактнаяИнформацияКлючаПомещения.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтактнаяИнформацияКлючаПомещения КАК КонтактнаяИнформацияКлючаПомещения
	|		ПО ВложенныйЗапрос.КлючПомещения = КонтактнаяИнформацияКлючаПомещения.КлючПомещения
	|			И ВложенныйЗапрос.НомерСтроки = КонтактнаяИнформацияКлючаПомещения.НомерСтроки");	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаКонтактнаяИнформацияКлючаПомещения(ИмяВременнойТаблицыИсточника) 
	Шаблон = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.АдресОбъектаЛС КАК АдресОбъектаЛС,
	|	ВложенныйЗапрос.Значение КАК ЗначениеПолейКИ,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ КонтактнаяИнформацияКлючаПомещения
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВыборкаКлючейПомещений.КлючПомещения КАК КлючПомещения,
	|		энргСтроенияКонтактнаяИнформация.Представление КАК АдресОбъектаЛС,
	|		энргСтроенияКонтактнаяИнформация.Значение КАК Значение,
	|		энргСтроенияКонтактнаяИнформация.НомерСтроки КАК НомерСтроки
	|	ИЗ
	|		%1 КАК ВыборкаКлючейПомещений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО ВыборкаКлючейПомещений.Строение = энргСтроенияКонтактнаяИнформация.Ссылка
	|				И (энргСтроенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргСтроенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДома))
	|				И (ВыборкаКлючейПомещений.ЧастныйСектор)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВыборкаКлючейПомещений.КлючПомещения,
	|		энргПомещенияКонтактнаяИнформация.Представление,
	|		энргПомещенияКонтактнаяИнформация.Значение,
	|		энргПомещенияКонтактнаяИнформация.НомерСтроки
	|	ИЗ
	|		%1 КАК ВыборкаКлючейПомещений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	|			ПО ВыборкаКлючейПомещений.Помещение = энргПомещенияКонтактнаяИнформация.Ссылка
	|				И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|				И (энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	|				И (НЕ ВыборкаКлючейПомещений.ЧастныйСектор)) КАК ВложенныйЗапрос";
	
	Результат = СтрШаблон(Шаблон, ИмяВременнойТаблицыИсточника);
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
